[NoCoverage] StringLiteral
src/utils/formatters.ts:4:53
 import { z } from 'zod';
 
 // Zod schemas for validation
-export const CurrencySchema = z.enum(['USD', 'EUR', 'GBP', 'JPY']);
+export const CurrencySchema = z.enum(['USD', 'EUR', "", 'JPY']);
 export const LocaleSchema = z.string().min(2);
 

[NoCoverage] StringLiteral
src/utils/formatters.ts:4:39
 import { z } from 'zod';
 
 // Zod schemas for validation
-export const CurrencySchema = z.enum(['USD', 'EUR', 'GBP', 'JPY']);
+export const CurrencySchema = z.enum(["", 'EUR', 'GBP', 'JPY']);
 export const LocaleSchema = z.string().min(2);
 

[NoCoverage] MethodExpression
src/utils/formatters.ts:5:29
 
 // Zod schemas for validation
 export const CurrencySchema = z.enum(['USD', 'EUR', 'GBP', 'JPY']);
-export const LocaleSchema = z.string().min(2);
+export const LocaleSchema = z.string().max(2);
 
 export type Currency = z.infer<typeof CurrencySchema>;

[NoCoverage] BlockStatement
src/utils/formatters.ts:16:11
   amount: number,
   currency: Currency = 'USD',
   locale = 'en-US'
-): string {
-  // Validate inputs
-  CurrencySchema.parse(currency);
-  LocaleSchema.parse(locale);
-
-  if (!Number.isFinite(amount)) {
-    throw new Error('Amount must be a finite number');
-  }
-
-  return new Intl.NumberFormat(locale, {
-    style: 'currency',
-    currency,
-  }).format(amount);
-}
+): string {}
 
 /**

[NoCoverage] BlockStatement
src/utils/formatters.ts:21:33
   CurrencySchema.parse(currency);
   LocaleSchema.parse(locale);
 
-  if (!Number.isFinite(amount)) {
-    throw new Error('Amount must be a finite number');
-  }
+  if (!Number.isFinite(amount)) {}
 
   return new Intl.NumberFormat(locale, {

[NoCoverage] ConditionalExpression
src/utils/formatters.ts:21:7
   CurrencySchema.parse(currency);
   LocaleSchema.parse(locale);
 
-  if (!Number.isFinite(amount)) {
+  if (true) {
     throw new Error('Amount must be a finite number');
   }

[NoCoverage] BlockStatement
src/utils/formatters.ts:34:71
 /**
  * Format percentage with specified decimal places
  */
-export function formatPercentage(value: number, decimals = 2): string {
-  if (!Number.isFinite(value)) {
-    throw new Error('Value must be a finite number');
-  }
-
-  if (decimals < 0 || decimals > 10) {
-    throw new Error('Decimals must be between 0 and 10');
-  }
-
-  return `${(value * 100).toFixed(decimals)}%`;
-}
+export function formatPercentage(value: number, decimals = 2): string {}
 
 /**

[NoCoverage] BooleanLiteral
src/utils/formatters.ts:35:7
  * Format percentage with specified decimal places
  */
 export function formatPercentage(value: number, decimals = 2): string {
-  if (!Number.isFinite(value)) {
+  if (Number.isFinite(value)) {
     throw new Error('Value must be a finite number');
   }

[NoCoverage] ConditionalExpression
src/utils/formatters.ts:35:7
  * Format percentage with specified decimal places
  */
 export function formatPercentage(value: number, decimals = 2): string {
-  if (!Number.isFinite(value)) {
+  if (false) {
     throw new Error('Value must be a finite number');
   }

[NoCoverage] StringLiteral
src/utils/formatters.ts:36:21
  */
 export function formatPercentage(value: number, decimals = 2): string {
   if (!Number.isFinite(value)) {
-    throw new Error('Value must be a finite number');
+    throw new Error("");
   }
 

[NoCoverage] EqualityOperator
src/utils/formatters.ts:39:23
     throw new Error('Value must be a finite number');
   }
 
-  if (decimals < 0 || decimals > 10) {
+  if (decimals < 0 || decimals <= 10) {
     throw new Error('Decimals must be between 0 and 10');
   }

[NoCoverage] ConditionalExpression
src/utils/formatters.ts:39:7
     throw new Error('Value must be a finite number');
   }
 
-  if (decimals < 0 || decimals > 10) {
+  if (true) {
     throw new Error('Decimals must be between 0 and 10');
   }

[NoCoverage] ArithmeticOperator
src/utils/formatters.ts:43:14
     throw new Error('Decimals must be between 0 and 10');
   }
 
-  return `${(value * 100).toFixed(decimals)}%`;
+  return `${(value / 100).toFixed(decimals)}%`;
 }
 

[NoCoverage] StringLiteral
src/utils/formatters.ts:43:10
     throw new Error('Decimals must be between 0 and 10');
   }
 
-  return `${(value * 100).toFixed(decimals)}%`;
+  return ``;
 }
 

[NoCoverage] BlockStatement
src/utils/formatters.ts:49:55
 /**
  * Format file size in human-readable format
  */
-export function formatFileSize(bytes: number): string {
-  if (!Number.isInteger(bytes) || bytes < 0) {
-    throw new Error('Bytes must be a non-negative integer');
-  }
-
-  const units = ['B', 'KB', 'MB', 'GB', 'TB'];
-  let size = bytes;
-  let unitIndex = 0;
-
-  while (size >= 1024 && unitIndex < units.length - 1) {
-    size /= 1024;
-    unitIndex++;
-  }
-
-  // Use the units array to ensure mutations are meaningful
-  const unit = units.at(unitIndex) ?? 'B';
-  return `${size.toFixed(1)} ${unit}`;
-}
+export function formatFileSize(bytes: number): string {}
 

[NoCoverage] ConditionalExpression
src/utils/formatters.ts:50:7
  * Format file size in human-readable format
  */
 export function formatFileSize(bytes: number): string {
-  if (!Number.isInteger(bytes) || bytes < 0) {
+  if (false) {
     throw new Error('Bytes must be a non-negative integer');
   }

[NoCoverage] EqualityOperator
src/utils/formatters.ts:50:35
  * Format file size in human-readable format
  */
 export function formatFileSize(bytes: number): string {
-  if (!Number.isInteger(bytes) || bytes < 0) {
+  if (!Number.isInteger(bytes) || bytes <= 0) {
     throw new Error('Bytes must be a non-negative integer');
   }

[NoCoverage] StringLiteral
src/utils/formatters.ts:51:21
  */
 export function formatFileSize(bytes: number): string {
   if (!Number.isInteger(bytes) || bytes < 0) {
-    throw new Error('Bytes must be a non-negative integer');
+    throw new Error("");
   }
 

[NoCoverage] StringLiteral
src/utils/formatters.ts:54:35
     throw new Error('Bytes must be a non-negative integer');
   }
 
-  const units = ['B', 'KB', 'MB', 'GB', 'TB'];
+  const units = ['B', 'KB', 'MB', "", 'TB'];
   let size = bytes;
   let unitIndex = 0;

[NoCoverage] ArrayDeclaration
src/utils/formatters.ts:54:17
     throw new Error('Bytes must be a non-negative integer');
   }
 
-  const units = ['B', 'KB', 'MB', 'GB', 'TB'];
+  const units = [];
   let size = bytes;
   let unitIndex = 0;

[NoCoverage] ConditionalExpression
src/utils/formatters.ts:58:10
   let size = bytes;
   let unitIndex = 0;
 
-  while (size >= 1024 && unitIndex < units.length - 1) {
+  while (true && unitIndex < units.length - 1) {
     size /= 1024;
     unitIndex++;

[NoCoverage] EqualityOperator
src/utils/formatters.ts:58:26
   let size = bytes;
   let unitIndex = 0;
 
-  while (size >= 1024 && unitIndex < units.length - 1) {
+  while (size >= 1024 && unitIndex <= units.length - 1) {
     size /= 1024;
     unitIndex++;

[NoCoverage] AssignmentOperator
src/utils/formatters.ts:59:5
   let unitIndex = 0;
 
   while (size >= 1024 && unitIndex < units.length - 1) {
-    size /= 1024;
+    size *= 1024;
     unitIndex++;
   }

[NoCoverage] LogicalOperator
src/utils/formatters.ts:64:16
   }
 
   // Use the units array to ensure mutations are meaningful
-  const unit = units.at(unitIndex) ?? 'B';
+  const unit = units.at(unitIndex) && 'B';
   return `${size.toFixed(1)} ${unit}`;
 }
