[NoCoverage] StringLiteral
src/utils/validators.ts:6:45
 /**
  * Email validation with proper regex and Zod schema
  */
-export const EmailSchema = z.string().email('Invalid email format');
+export const EmailSchema = z.string().email("");
 
 export function isValidEmail(email: string): boolean {

[NoCoverage] BlockStatement
src/utils/validators.ts:8:54
  */
 export const EmailSchema = z.string().email('Invalid email format');
 
-export function isValidEmail(email: string): boolean {
-  try {
-    EmailSchema.parse(email);
-    return true;
-  } catch {
-    return false;
-  }
-}
+export function isValidEmail(email: string): boolean {}
 
 /**

[NoCoverage] BlockStatement
src/utils/validators.ts:9:7
 export const EmailSchema = z.string().email('Invalid email format');
 
 export function isValidEmail(email: string): boolean {
-  try {
-    EmailSchema.parse(email);
-    return true;
-  } catch {
+  try {} catch {
     return false;
   }

[NoCoverage] BooleanLiteral
src/utils/validators.ts:11:12
 export function isValidEmail(email: string): boolean {
   try {
     EmailSchema.parse(email);
-    return true;
+    return false;
   } catch {
     return false;

[NoCoverage] BlockStatement
src/utils/validators.ts:22:50
  */
 export const UrlSchema = z.string().url('Invalid URL format');
 
-export function isValidUrl(url: string): boolean {
-  try {
-    UrlSchema.parse(url);
-    return true;
-  } catch {
-    return false;
-  }
-}
+export function isValidUrl(url: string): boolean {}
 
 /**

[NoCoverage] BlockStatement
src/utils/validators.ts:23:7
 export const UrlSchema = z.string().url('Invalid URL format');
 
 export function isValidUrl(url: string): boolean {
-  try {
-    UrlSchema.parse(url);
-    return true;
-  } catch {
+  try {} catch {
     return false;
   }

[NoCoverage] BooleanLiteral
src/utils/validators.ts:25:12
 export function isValidUrl(url: string): boolean {
   try {
     UrlSchema.parse(url);
-    return true;
+    return false;
   } catch {
     return false;

[NoCoverage] Regex
src/utils/validators.ts:37:5
 export const PhoneSchema = z
   .string()
   .regex(
-    /^\+?1?[-.\s]?\(?([0-9]{3})\)?[-.\s]?([0-9]{3})[-.\s]?([0-9]{4})$/,
+    /^\+?1?[-.\s]?\(?([0-9]{3})\)?[-.\s]?([0-9])[-.\s]?([0-9]{4})$/,
     'Invalid phone number format'
   );

[NoCoverage] Regex
src/utils/validators.ts:37:5
 export const PhoneSchema = z
   .string()
   .regex(
-    /^\+?1?[-.\s]?\(?([0-9]{3})\)?[-.\s]?([0-9]{3})[-.\s]?([0-9]{4})$/,
+    /^\+?1?[-.\s]?\(?([0-9]{3})\)?[-.\s]?([0-9]{3})[-.\s]?([0-9]{4})/,
     'Invalid phone number format'
   );

[NoCoverage] BlockStatement
src/utils/validators.ts:41:60
     'Invalid phone number format'
   );
 
-export function isValidPhoneNumber(phone: string): boolean {
-  try {
-    PhoneSchema.parse(phone);
-    return true;
-  } catch {
-    return false;
-  }
-}
+export function isValidPhoneNumber(phone: string): boolean {}
 
 /**

[NoCoverage] BlockStatement
src/utils/validators.ts:42:7
   );
 
 export function isValidPhoneNumber(phone: string): boolean {
-  try {
-    PhoneSchema.parse(phone);
-    return true;
-  } catch {
+  try {} catch {
     return false;
   }

[NoCoverage] BooleanLiteral
src/utils/validators.ts:44:12
 export function isValidPhoneNumber(phone: string): boolean {
   try {
     PhoneSchema.parse(phone);
-    return true;
+    return false;
   } catch {
     return false;

[NoCoverage] MethodExpression
src/utils/validators.ts:53:31
 /**
  * Password strength validation
  */
-export const PasswordSchema = z
-  .string()
-  .min(8, 'Password must be at least 8 characters')
+export const PasswordSchema = z.string().max(8, 'Password must be at least 8 characters')
   .regex(/[A-Z]/, 'Password must contain at least one uppercase letter')
   .regex(/[a-z]/, 'Password must contain at least one lowercase letter')

[NoCoverage] StringLiteral
src/utils/validators.ts:57:19
   .string()
   .min(8, 'Password must be at least 8 characters')
   .regex(/[A-Z]/, 'Password must contain at least one uppercase letter')
-  .regex(/[a-z]/, 'Password must contain at least one lowercase letter')
+  .regex(/[a-z]/, "")
   .regex(/[0-9]/, 'Password must contain at least one number')
   .regex(

[NoCoverage] Regex
src/utils/validators.ts:57:10
   .string()
   .min(8, 'Password must be at least 8 characters')
   .regex(/[A-Z]/, 'Password must contain at least one uppercase letter')
-  .regex(/[a-z]/, 'Password must contain at least one lowercase letter')
+  .regex(/[^a-z]/, 'Password must contain at least one lowercase letter')
   .regex(/[0-9]/, 'Password must contain at least one number')
   .regex(

[NoCoverage] Regex
src/utils/validators.ts:60:5
   .regex(/[a-z]/, 'Password must contain at least one lowercase letter')
   .regex(/[0-9]/, 'Password must contain at least one number')
   .regex(
-    /[^A-Za-z0-9]/,
+    /[A-Za-z0-9]/,
     'Password must contain at least one special character'
   );

[NoCoverage] StringLiteral
src/utils/validators.ts:61:5
   .regex(/[0-9]/, 'Password must contain at least one number')
   .regex(
     /[^A-Za-z0-9]/,
-    'Password must contain at least one special character'
+    ""
   );
 

[NoCoverage] BlockStatement
src/utils/validators.ts:67:3
 export function validatePasswordStrength(password: string): {
   isValid: boolean;
   errors: string[];
-} {
-  try {
-    PasswordSchema.parse(password);
-    return { isValid: true, errors: [] };
-  } catch (error) {
-    // Zod always throws ZodError for validation failures
-    const zodError = error as z.ZodError;
-    return {
-      isValid: false,
-      errors: zodError.errors.map(err => err.message),
-    };
-  }
-}
+} {}
 

[NoCoverage] BlockStatement
src/utils/validators.ts:68:7
   isValid: boolean;
   errors: string[];
 } {
-  try {
-    PasswordSchema.parse(password);
-    return { isValid: true, errors: [] };
-  } catch (error) {
+  try {} catch (error) {
     // Zod always throws ZodError for validation failures
     const zodError = error as z.ZodError;

[NoCoverage] BooleanLiteral
src/utils/validators.ts:70:23
 } {
   try {
     PasswordSchema.parse(password);
-    return { isValid: true, errors: [] };
+    return { isValid: false, errors: [] };
   } catch (error) {
     // Zod always throws ZodError for validation failures

[NoCoverage] BlockStatement
src/utils/validators.ts:71:19
   try {
     PasswordSchema.parse(password);
     return { isValid: true, errors: [] };
-  } catch (error) {
-    // Zod always throws ZodError for validation failures
-    const zodError = error as z.ZodError;
-    return {
-      isValid: false,
-      errors: zodError.errors.map(err => err.message),
-    };
-  }
+  } catch (error) {}
 }
 

[NoCoverage] BooleanLiteral
src/utils/validators.ts:75:16
     // Zod always throws ZodError for validation failures
     const zodError = error as z.ZodError;
     return {
-      isValid: false,
+      isValid: true,
       errors: zodError.errors.map(err => err.message),
     };

[NoCoverage] ArrowFunction
src/utils/validators.ts:76:35
     const zodError = error as z.ZodError;
     return {
       isValid: false,
-      errors: zodError.errors.map(err => err.message),
+      errors: zodError.errors.map(() => undefined),
     };
   }
