[Killed] MethodExpression
src/utils/calculations.ts:5:10
 
 // Zod schemas for input validation
 export const ItemSchema = z.object({
-  price: z.number().min(0, 'Price must be non-negative'),
+  price: z.number().max(0, 'Price must be non-negative'),
   quantity: z.number().int().min(0, 'Quantity must be a non-negative integer'),
 });
killedBy: calculateTotal should calculate total for single item
statusReason: [
  {
    "code": "too_big",
    "maximum": 0,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Price must be non-negative",

[Killed] MethodExpression
src/utils/calculations.ts:6:13
 // Zod schemas for input validation
 export const ItemSchema = z.object({
   price: z.number().min(0, 'Price must be non-negative'),
-  quantity: z.number().int().min(0, 'Quantity must be a non-negative integer'),
+  quantity: z.number().int().max(0, 'Quantity must be a non-negative integer'),
 });
 
killedBy: calculateTotal should calculate total for single item
statusReason: [
  {
    "code": "too_big",
    "maximum": 0,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Quantity must be a non-negative integer",

[Killed] BlockStatement
src/utils/calculations.ts:16:55
 /**
  * Calculate the total cost of items with price and quantity validation
  */
-export function calculateTotal(items: Item[]): number {
-  // Validate input using Zod
-  const validatedItems = ItemsArraySchema.parse(items);
-
-  return validatedItems.reduce((total, item) => {
-    return total + item.price * item.quantity;
-  }, 0);
-}
+export function calculateTotal(items: Item[]): number {}
 
 /**
killedBy: calculateTotal should calculate total for empty array
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/utils/calculations.ts:20:49
   // Validate input using Zod
   const validatedItems = ItemsArraySchema.parse(items);
 
-  return validatedItems.reduce((total, item) => {
-    return total + item.price * item.quantity;
-  }, 0);
+  return validatedItems.reduce((total, item) => {}, 0);
 }
 
killedBy: calculateTotal should calculate total for single item
statusReason: expected undefined to be 21 // Object.is equality

[Killed] ArithmeticOperator
src/utils/calculations.ts:21:12
   const validatedItems = ItemsArraySchema.parse(items);
 
   return validatedItems.reduce((total, item) => {
-    return total + item.price * item.quantity;
+    return total - item.price * item.quantity;
   }, 0);
 }
killedBy: calculateTotal should calculate total for single item
statusReason: expected -21 to be 21 // Object.is equality

[Killed] ArithmeticOperator
src/utils/calculations.ts:21:20
   const validatedItems = ItemsArraySchema.parse(items);
 
   return validatedItems.reduce((total, item) => {
-    return total + item.price * item.quantity;
+    return total + item.price / item.quantity;
   }, 0);
 }
killedBy: calculateTotal should calculate total for single item
statusReason: expected 5.25 to be 21 // Object.is equality

[Killed] BlockStatement
src/utils/calculations.ts:28:79
 /**
  * Calculate total with tax applied
  */
-export function calculateTotalWithTax(items: Item[], taxRate: number): number {
-  if (taxRate < 0 || taxRate > 1) {
-    throw new Error('Tax rate must be between 0 and 1');
-  }
-
-  const subtotal = calculateTotal(items);
-  return subtotal * (1 + taxRate);
-}
+export function calculateTotalWithTax(items: Item[], taxRate: number): number {}
 
 /**
killedBy: calculateTotalWithTax should calculate total with tax correctly
statusReason: expected undefined to be 108 // Object.is equality

[Killed] ConditionalExpression
src/utils/calculations.ts:29:22
  * Calculate total with tax applied
  */
 export function calculateTotalWithTax(items: Item[], taxRate: number): number {
-  if (taxRate < 0 || taxRate > 1) {
+  if (taxRate < 0 || false) {
     throw new Error('Tax rate must be between 0 and 1');
   }
killedBy: calculateTotalWithTax should throw error for tax rate over 100%
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/utils/calculations.ts:29:7
  * Calculate total with tax applied
  */
 export function calculateTotalWithTax(items: Item[], taxRate: number): number {
-  if (taxRate < 0 || taxRate > 1) {
+  if (taxRate >= 0 || taxRate > 1) {
     throw new Error('Tax rate must be between 0 and 1');
   }
killedBy: calculateTotalWithTax should calculate total with tax correctly
statusReason: Tax rate must be between 0 and 1

[Killed] ArithmeticOperator
src/utils/calculations.ts:34:22
   }
 
   const subtotal = calculateTotal(items);
-  return subtotal * (1 + taxRate);
+  return subtotal * (1 - taxRate);
 }
 
killedBy: calculateTotalWithTax should calculate total with tax correctly
statusReason: expected 92 to be 108 // Object.is equality

[Killed] ArithmeticOperator
src/utils/calculations.ts:34:10
   }
 
   const subtotal = calculateTotal(items);
-  return subtotal * (1 + taxRate);
+  return subtotal / (1 + taxRate);
 }
 
killedBy: calculateTotalWithTax should calculate total with tax correctly
statusReason: expected 92.59259259259258 to be 108 // Object.is equality

[Killed] BlockStatement
src/utils/calculations.ts:43:11
 export function calculateDiscount(
   amount: number,
   discountPercentage: number
-): number {
-  if (discountPercentage < 0 || discountPercentage > 100) {
-    throw new Error('Discount percentage must be between 0 and 100');
-  }
-
-  return amount * (discountPercentage / 100);
-}
+): number {}
 
killedBy: calculateDiscount should calculate discount correctly
statusReason: expected undefined to be 10 // Object.is equality

[Killed] ConditionalExpression
src/utils/calculations.ts:44:7
   amount: number,
   discountPercentage: number
 ): number {
-  if (discountPercentage < 0 || discountPercentage > 100) {
+  if (false) {
     throw new Error('Discount percentage must be between 0 and 100');
   }
killedBy: calculateDiscount should throw error for negative discount percentage
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/utils/calculations.ts:44:7
   amount: number,
   discountPercentage: number
 ): number {
-  if (discountPercentage < 0 || discountPercentage > 100) {
+  if (false || discountPercentage > 100) {
     throw new Error('Discount percentage must be between 0 and 100');
   }
killedBy: calculateDiscount should throw error for negative discount percentage
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/utils/calculations.ts:48:20
     throw new Error('Discount percentage must be between 0 and 100');
   }
 
-  return amount * (discountPercentage / 100);
+  return amount * (discountPercentage * 100);
 }
 
killedBy: calculateDiscount should calculate discount correctly
statusReason: expected 100000 to be 10 // Object.is equality

[Killed] ArithmeticOperator
src/utils/calculations.ts:48:10
     throw new Error('Discount percentage must be between 0 and 100');
   }
 
-  return amount * (discountPercentage / 100);
+  return amount / (discountPercentage / 100);
 }
 
killedBy: calculateDiscount should calculate discount correctly
statusReason: expected 1000 to be 10 // Object.is equality
