[Killed] EqualityOperator
backend-api/src/utils/calculations.ts:29:22
  * Calculate total with tax applied
  */
 export function calculateTotalWithTax(items: Item[], taxRate: number): number {
-  if (taxRate < 0 || taxRate > 1) {
+  if (taxRate < 0 || taxRate >= 1) {
     throw new Error('Tax rate must be between 0 and 1');
   }
killedBy: calculateTotalWithTax should handle 100% tax rate
statusReason: Tax rate must be between 0 and 1

[Killed] LogicalOperator
backend-api/src/utils/calculations.ts:44:7
   amount: number,
   discountPercentage: number
 ): number {
-  if (discountPercentage < 0 || discountPercentage > 100) {
+  if (discountPercentage < 0 && discountPercentage > 100) {
     throw new Error('Discount percentage must be between 0 and 100');
   }
killedBy: calculateDiscount should throw error for negative discount percentage
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
backend-api/src/utils/calculations.ts:44:59
   amount: number,
   discountPercentage: number
 ): number {
-  if (discountPercentage < 0 || discountPercentage > 100) {
-    throw new Error('Discount percentage must be between 0 and 100');
-  }
+  if (discountPercentage < 0 || discountPercentage > 100) {}
 
   return amount * (discountPercentage / 100);
killedBy: calculateDiscount should throw error for negative discount percentage
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
backend-api/src/utils/calculations.ts:45:21
   discountPercentage: number
 ): number {
   if (discountPercentage < 0 || discountPercentage > 100) {
-    throw new Error('Discount percentage must be between 0 and 100');
+    throw new Error("");
   }
 
killedBy: calculateDiscount should throw error for negative discount percentage
statusReason: expected [Function] to throw error including 'Discount percentage must be between 0…' but got ''
