[Killed] BooleanLiteral
backend-api/src/utils/formatters.ts:21:7
   CurrencySchema.parse(currency);
   LocaleSchema.parse(locale);
 
-  if (!Number.isFinite(amount)) {
+  if (Number.isFinite(amount)) {
     throw new Error('Amount must be a finite number');
   }
killedBy: formatCurrency should format USD by default
statusReason: Amount must be a finite number

[Killed] StringLiteral
backend-api/src/utils/formatters.ts:22:21
   LocaleSchema.parse(locale);
 
   if (!Number.isFinite(amount)) {
-    throw new Error('Amount must be a finite number');
+    throw new Error("");
   }
 
killedBy: formatCurrency should throw error for non-finite amounts
statusReason: expected [Function] to throw error including 'Amount must be a finite number' but got ''

[Killed] ObjectLiteral
backend-api/src/utils/formatters.ts:25:40
     throw new Error('Amount must be a finite number');
   }
 
-  return new Intl.NumberFormat(locale, {
-    style: 'currency',
-    currency,
-  }).format(amount);
+  return new Intl.NumberFormat(locale, {}).format(amount);
 }
 
killedBy: formatCurrency should format USD by default
statusReason: expected '1,234.56' to be '$1,234.56' // Object.is equality

[Killed] BlockStatement
backend-api/src/utils/formatters.ts:35:32
  * Format percentage with specified decimal places
  */
 export function formatPercentage(value: number, decimals: number = 2): string {
-  if (!Number.isFinite(value)) {
-    throw new Error('Value must be a finite number');
-  }
+  if (!Number.isFinite(value)) {}
 
   if (decimals < 0 || decimals > 10) {
killedBy: formatPercentage should throw error for non-finite values
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
backend-api/src/utils/formatters.ts:35:7
  * Format percentage with specified decimal places
  */
 export function formatPercentage(value: number, decimals: number = 2): string {
-  if (!Number.isFinite(value)) {
+  if (false) {
     throw new Error('Value must be a finite number');
   }
killedBy: formatPercentage should throw error for non-finite values
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
backend-api/src/utils/formatters.ts:39:23
     throw new Error('Value must be a finite number');
   }
 
-  if (decimals < 0 || decimals > 10) {
+  if (decimals < 0 || decimals >= 10) {
     throw new Error('Decimals must be between 0 and 10');
   }
killedBy: formatPercentage should accept exactly 10 decimal places
statusReason: Decimals must be between 0 and 10

[Killed] BlockStatement
backend-api/src/utils/formatters.ts:50:46
  * Format file size in human-readable format
  */
 export function formatFileSize(bytes: number): string {
-  if (!Number.isInteger(bytes) || bytes < 0) {
-    throw new Error('Bytes must be a non-negative integer');
-  }
+  if (!Number.isInteger(bytes) || bytes < 0) {}
 
   const units = ['B', 'KB', 'MB', 'GB', 'TB'];
killedBy: formatFileSize should throw error for negative bytes
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
backend-api/src/utils/formatters.ts:50:7
  * Format file size in human-readable format
  */
 export function formatFileSize(bytes: number): string {
-  if (!Number.isInteger(bytes) || bytes < 0) {
+  if (!Number.isInteger(bytes) && bytes < 0) {
     throw new Error('Bytes must be a non-negative integer');
   }
killedBy: formatFileSize should throw error for negative bytes
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
backend-api/src/utils/formatters.ts:54:29
     throw new Error('Bytes must be a non-negative integer');
   }
 
-  const units = ['B', 'KB', 'MB', 'GB', 'TB'];
+  const units = ['B', 'KB', "", 'GB', 'TB'];
   let size = bytes;
   let unitIndex = 0;
killedBy: formatFileSize should format megabytes correctly
statusReason: expected '1.0 B' to be '1.0 MB' // Object.is equality

[Killed] EqualityOperator
backend-api/src/utils/formatters.ts:58:10
   let size = bytes;
   let unitIndex = 0;
 
-  while (size >= 1024 && unitIndex < units.length - 1) {
+  while (size < 1024 && unitIndex < units.length - 1) {
     size /= 1024;
     unitIndex++;
killedBy: formatFileSize should format bytes correctly
statusReason: expected '0.0 TB' to be '0.0 B' // Object.is equality

[Killed] ConditionalExpression
backend-api/src/utils/formatters.ts:64:32
   }
 
   // Use the units array to ensure mutations are meaningful
-  return `${size.toFixed(1)} ${units[unitIndex] || 'B'}`;
+  return `${size.toFixed(1)} ${true}`;
 }
 
killedBy: formatFileSize should format bytes correctly
statusReason: expected '0.0 true' to be '0.0 B' // Object.is equality

[Killed] LogicalOperator
backend-api/src/utils/formatters.ts:64:32
   }
 
   // Use the units array to ensure mutations are meaningful
-  return `${size.toFixed(1)} ${units[unitIndex] || 'B'}`;
+  return `${size.toFixed(1)} ${units[unitIndex] && 'B'}`;
 }
 
killedBy: formatFileSize should format kilobytes correctly
statusReason: expected '1.0 B' to be '1.0 KB' // Object.is equality
