[Killed] BlockStatement
backend-api/src/utils/validators.ts:72:38
     PasswordSchema.parse(password);
     return { isValid: true, errors: [] };
   } catch (error) {
-    if (error instanceof z.ZodError) {
-      return {
-        isValid: false,
-        errors: error.errors.map(err => err.message),
-      };
-    }
+    if (error instanceof z.ZodError) {}
     return { isValid: false, errors: ['Unknown validation error'] };
   }
killedBy: validatePasswordStrength should reject password too short
statusReason: expected [ 'Unknown validation error' ] to include 'Password must be at least 8 characters'

[NoCoverage] BooleanLiteral
backend-api/src/utils/validators.ts:78:23
         errors: error.errors.map(err => err.message),
       };
     }
-    return { isValid: false, errors: ['Unknown validation error'] };
+    return { isValid: true, errors: ['Unknown validation error'] };
   }
 }
