[Killed] BlockStatement
src/routes/example/index.ts:5:44
 
 const example: FastifyPluginAsync =
   // eslint-disable-next-line require-await
-  async (fastify, _opts): Promise<void> => {
-    fastify.get(
-      '/',
-      // eslint-disable-next-line require-await
-      async (_request, _reply) => 'this is an example'
-    );
-  };
+  async (fastify, _opts): Promise<void> => {};
 
 export default example;
killedBy: Example Route Unit Tests should register example route successfully
statusReason: expected 404 to be 200 // Object.is equality

[Timeout] ArrowFunction
src/routes/example/index.ts:9:7
     fastify.get(
       '/',
       // eslint-disable-next-line require-await
-      async (_request, _reply) => 'this is an example'
+      () => undefined
     );
   };
