[Killed] BlockStatement
backend-api/src/routes/root.ts:5:44
 
 const root: FastifyPluginAsync =
   // eslint-disable-next-line require-await
-  async (fastify, _opts): Promise<void> => {
-    fastify.get(
-      '/',
-      // eslint-disable-next-line require-await
-      async (_request, _reply) => ({ message: 'Hello World!' })
-    );
-  };
+  async (fastify, _opts): Promise<void> => {};
 
 export default root;
killedBy: Root Route Unit Tests should register root route successfully
statusReason: expected 404 to be 200 // Object.is equality

[Timeout] ArrowFunction
backend-api/src/routes/root.ts:9:7
     fastify.get(
       '/',
       // eslint-disable-next-line require-await
-      async (_request, _reply) => ({ message: 'Hello World!' })
+      () => undefined
     );
   };

[Killed] ObjectLiteral
backend-api/src/routes/root.ts:9:36
     fastify.get(
       '/',
       // eslint-disable-next-line require-await
-      async (_request, _reply) => ({ message: 'Hello World!' })
+      async (_request, _reply) => ({})
     );
   };
killedBy: Root Route Unit Tests should register root route successfully
statusReason: expected {} to deeply equal { message: 'Hello World!' }
