[Killed] BlockStatement
backend-api/src/plugins/support.ts:9:29
 // to export the decorators to the outer scope
 export default fp<SupportPluginOptions>(
   // eslint-disable-next-line require-await
-  async (fastify, _opts) => {
-    fastify.decorate('someSupport', () => 'hugs');
-  }
+  async (fastify, _opts) => {}
 );
 
killedBy: Support plugin Plugin registration should be compatible with fastify-plugin
statusReason: expected undefined to be defined

[Killed] StringLiteral
backend-api/src/plugins/support.ts:10:22
 export default fp<SupportPluginOptions>(
   // eslint-disable-next-line require-await
   async (fastify, _opts) => {
-    fastify.decorate('someSupport', () => 'hugs');
+    fastify.decorate("", () => 'hugs');
   }
 );
killedBy: Support plugin Plugin registration should be compatible with fastify-plugin
statusReason: expected undefined to be defined
