[Killed] BlockStatement
backend-api/src/plugins/sensible.ts:12:20
  */
 export default fp<FastifySensibleOptions>(
   // eslint-disable-next-line require-await
-  async fastify => {
-    fastify.register(sensible);
-  }
+  async fastify => {}
 );
 
killedBy: Sensible Plugin Unit Tests should register sensible plugin successfully
statusReason: expected undefined to be defined
