[Killed] BlockStatement
apps/backend-api/src/app.ts:22:21
 const app: FastifyPluginAsync<AppOptions> = async (
   fastify,
   opts
-): Promise<void> => {
-  // Register env plugin first
-  await fastify.register(envPlugin);
-
-  // Place here your custom code!
-
-  // Do not touch the following lines
-
-  // This loads all plugins defined in plugins
-  // those should be support plugins that are reused
-  // through your application
-  void fastify.register(AutoLoad, {
-    dir: join(__dirname, 'plugins'),
-    ignorePattern: /.*env\.(ts|js)$/,
-    options: opts,
-  });
-
-  // This loads all plugins defined in routes
-  // define your routes in one of these
-  void fastify.register(AutoLoad, {
-    dir: join(__dirname, 'routes'),
-    options: opts,
-  });
-};
+): Promise<void> => {};
 
 export default app;
killedBy: Root routes GET / should return hello world message
statusReason: expected 404 to be 200 // Object.is equality

[Survived] Regex
apps/backend-api/src/app.ts:35:20
   // through your application
   void fastify.register(AutoLoad, {
     dir: join(__dirname, 'plugins'),
-    ignorePattern: /.*env\.(ts|js)$/,
+    ignorePattern: /.*env\.(ts|js)/,
     options: opts,
   });
