[Killed] StringLiteral
backend-api/src/utils/formatters.ts:4:60
 import { z } from 'zod';
 
 // Zod schemas for validation
-export const CurrencySchema = z.enum(['USD', 'EUR', 'GBP', 'JPY']);
+export const CurrencySchema = z.enum(['USD', 'EUR', 'GBP', ""]);
 export const LocaleSchema = z.string().min(2);
 
killedBy: formatCurrency should format different currencies
statusReason: [
  {
    "received": "JPY",
    "code": "invalid_enum_value",
    "options": [
      "USD",
      "EUR",
      "GBP",

[Killed] StringLiteral
backend-api/src/utils/formatters.ts:4:46
 import { z } from 'zod';
 
 // Zod schemas for validation
-export const CurrencySchema = z.enum(['USD', 'EUR', 'GBP', 'JPY']);
+export const CurrencySchema = z.enum(['USD', "", 'GBP', 'JPY']);
 export const LocaleSchema = z.string().min(2);
 
killedBy: formatCurrency should format different currencies
statusReason: [
  {
    "received": "EUR",
    "code": "invalid_enum_value",
    "options": [
      "USD",
      "",
      "GBP",

[Killed] BlockStatement
backend-api/src/utils/formatters.ts:39:38
     throw new Error('Value must be a finite number');
   }
 
-  if (decimals < 0 || decimals > 10) {
-    throw new Error('Decimals must be between 0 and 10');
-  }
+  if (decimals < 0 || decimals > 10) {}
 
   return `${(value * 100).toFixed(decimals)}%`;
killedBy: formatPercentage should throw error for invalid decimal places
statusReason: expected [Function] to throw error including 'Decimals must be between 0 and 10' but got 'toFixed() digits argument must be bet…'

[Killed] ConditionalExpression
backend-api/src/utils/formatters.ts:65:5
 
   // Use specific unit strings to avoid object injection
   switch (unitIndex) {
-    case 0:
-      return `${size.toFixed(1)} B`;
+    case 0:
     case 1:
       return `${size.toFixed(1)} KB`;
killedBy: formatFileSize should format bytes correctly
statusReason: expected '0.0 KB' to be '0.0 B' // Object.is equality

[Killed] StringLiteral
backend-api/src/utils/formatters.ts:66:14
   // Use specific unit strings to avoid object injection
   switch (unitIndex) {
     case 0:
-      return `${size.toFixed(1)} B`;
+      return ``;
     case 1:
       return `${size.toFixed(1)} KB`;
killedBy: formatFileSize should format bytes correctly
statusReason: expected '' to be '0.0 B' // Object.is equality

[Killed] ConditionalExpression
backend-api/src/utils/formatters.ts:67:5
   switch (unitIndex) {
     case 0:
       return `${size.toFixed(1)} B`;
-    case 1:
-      return `${size.toFixed(1)} KB`;
+    case 1:
     case 2:
       return `${size.toFixed(1)} MB`;
killedBy: formatFileSize should format kilobytes correctly
statusReason: expected '1.0 MB' to be '1.0 KB' // Object.is equality

[Killed] StringLiteral
backend-api/src/utils/formatters.ts:68:14
     case 0:
       return `${size.toFixed(1)} B`;
     case 1:
-      return `${size.toFixed(1)} KB`;
+      return ``;
     case 2:
       return `${size.toFixed(1)} MB`;
killedBy: formatFileSize should format kilobytes correctly
statusReason: expected '' to be '1.0 KB' // Object.is equality

[Killed] ConditionalExpression
backend-api/src/utils/formatters.ts:69:5
       return `${size.toFixed(1)} B`;
     case 1:
       return `${size.toFixed(1)} KB`;
-    case 2:
-      return `${size.toFixed(1)} MB`;
+    case 2:
     case 3:
       return `${size.toFixed(1)} GB`;
killedBy: formatFileSize should format megabytes correctly
statusReason: expected '1.0 GB' to be '1.0 MB' // Object.is equality

[Killed] ConditionalExpression
backend-api/src/utils/formatters.ts:71:5
       return `${size.toFixed(1)} KB`;
     case 2:
       return `${size.toFixed(1)} MB`;
-    case 3:
-      return `${size.toFixed(1)} GB`;
+    case 3:
     case 4:
       return `${size.toFixed(1)} TB`;
killedBy: formatFileSize should format gigabytes correctly
statusReason: expected '1.0 TB' to be '1.0 GB' // Object.is equality

[Killed] ConditionalExpression
backend-api/src/utils/formatters.ts:73:5
       return `${size.toFixed(1)} MB`;
     case 3:
       return `${size.toFixed(1)} GB`;
-    case 4:
-      return `${size.toFixed(1)} TB`;
+    case 4:
     default:
       return `${size.toFixed(1)} B`;
killedBy: formatFileSize should format terabytes correctly
statusReason: expected '1.0 B' to be '1.0 TB' // Object.is equality
