[Killed] Regex
backend-api/src/utils/validators.ts:37:5
 export const PhoneSchema = z
   .string()
   .regex(
-    /^\+?1?[-.\s]?\(?([0-9]{3})\)?[-.\s]?([0-9]{3})[-.\s]?([0-9]{4})$/,
+    /^\+?1?[-.\s]?\(?([0-9]{3})\)?[-.\s]?([^0-9]{3})[-.\s]?([0-9]{4})$/,
     'Invalid phone number format'
   );
killedBy: isValidPhoneNumber should validate correct US phone numbers
statusReason: expected false to be true // Object.is equality

[Killed] Regex
backend-api/src/utils/validators.ts:37:5
 export const PhoneSchema = z
   .string()
   .regex(
-    /^\+?1?[-.\s]?\(?([0-9]{3})\)?[-.\s]?([0-9]{3})[-.\s]?([0-9]{4})$/,
+    /^\+?1?[-.\S]?\(?([0-9]{3})\)?[-.\s]?([0-9]{3})[-.\s]?([0-9]{4})$/,
     'Invalid phone number format'
   );
killedBy: isValidPhoneNumber should validate correct US phone numbers
statusReason: expected false to be true // Object.is equality

[Killed] Regex
backend-api/src/utils/validators.ts:56:10
 export const PasswordSchema = z
   .string()
   .min(8, 'Password must be at least 8 characters')
-  .regex(/[A-Z]/, 'Password must contain at least one uppercase letter')
+  .regex(/[^A-Z]/, 'Password must contain at least one uppercase letter')
   .regex(/[a-z]/, 'Password must contain at least one lowercase letter')
   .regex(/[0-9]/, 'Password must contain at least one number')
killedBy: validatePasswordStrength should reject password without uppercase
statusReason: expected true to be false // Object.is equality
