[Survived] ObjectLiteral
backend-api/src/plugins/env.ts:14:13
     .default('development'),
 
   PORT: z
-    .string({
-      required_error: 'PORT environment variable is required',
-      invalid_type_error: 'PORT must be a string',
-    })
+    .string({})
     .regex(/^\d+$/, 'PORT must contain only numeric characters')
     .transform(Number)

[Timeout] Regex
backend-api/src/plugins/env.ts:18:12
       required_error: 'PORT environment variable is required',
       invalid_type_error: 'PORT must be a string',
     })
-    .regex(/^\d+$/, 'PORT must contain only numeric characters')
+    .regex(/^\d$/, 'PORT must contain only numeric characters')
     .transform(Number)
     .refine(n => n > 0 && n < 65536, 'PORT must be between 1-65535')

[Survived] Regex
backend-api/src/plugins/env.ts:18:12
       required_error: 'PORT environment variable is required',
       invalid_type_error: 'PORT must be a string',
     })
-    .regex(/^\d+$/, 'PORT must contain only numeric characters')
+    .regex(/^\d+/, 'PORT must contain only numeric characters')
     .transform(Number)
     .refine(n => n > 0 && n < 65536, 'PORT must be between 1-65535')

[Survived] EqualityOperator
backend-api/src/plugins/env.ts:20:18
     })
     .regex(/^\d+$/, 'PORT must contain only numeric characters')
     .transform(Number)
-    .refine(n => n > 0 && n < 65536, 'PORT must be between 1-65535')
+    .refine(n => n >= 0 && n < 65536, 'PORT must be between 1-65535')
     .default('3000'),
 

[Timeout] ConditionalExpression
backend-api/src/plugins/env.ts:20:18
     })
     .regex(/^\d+$/, 'PORT must contain only numeric characters')
     .transform(Number)
-    .refine(n => n > 0 && n < 65536, 'PORT must be between 1-65535')
+    .refine(n => false, 'PORT must be between 1-65535')
     .default('3000'),
 

[Timeout] MethodExpression
backend-api/src/plugins/env.ts:23:9
     .refine(n => n > 0 && n < 65536, 'PORT must be between 1-65535')
     .default('3000'),
 
-  HOST: z
-    .string({
-      invalid_type_error: 'HOST must be a string',
-    })
-    .min(1, 'HOST cannot be empty')
+  HOST: z.string({
+  invalid_type_error: 'HOST must be a string'
+}).max(1, 'HOST cannot be empty')
     .default('localhost'),
 

[Survived] StringLiteral
backend-api/src/plugins/env.ts:25:27
 
   HOST: z
     .string({
-      invalid_type_error: 'HOST must be a string',
+      invalid_type_error: "",
     })
     .min(1, 'HOST cannot be empty')

[Survived] StringLiteral
backend-api/src/plugins/env.ts:27:13
     .string({
       invalid_type_error: 'HOST must be a string',
     })
-    .min(1, 'HOST cannot be empty')
+    .min(1, "")
     .default('localhost'),
 

[Survived] ObjectLiteral
backend-api/src/plugins/env.ts:31:65
     .default('localhost'),
 
   LOG_LEVEL: z
-    .enum(['fatal', 'error', 'warn', 'info', 'debug', 'trace'], {
-      errorMap: () => ({
-        message:
-          'LOG_LEVEL must be one of: fatal, error, warn, info, debug, trace',
-      }),
-    })
+    .enum(['fatal', 'error', 'warn', 'info', 'debug', 'trace'], {})
     .default('info'),
 });

[Survived] StringLiteral
backend-api/src/plugins/env.ts:31:30
     .default('localhost'),
 
   LOG_LEVEL: z
-    .enum(['fatal', 'error', 'warn', 'info', 'debug', 'trace'], {
+    .enum(['fatal', 'error', "", 'info', 'debug', 'trace'], {
       errorMap: () => ({
         message:

[Survived] BlockStatement
backend-api/src/plugins/env.ts:57:54
 function createSafeConfig(config: Env): Record<string, unknown> {
   const safeConfig: Record<string, unknown> = {};
 
-  for (const [key, value] of Object.entries(config)) {
-    const isSensitive = SENSITIVE_PATTERNS.some(pattern => pattern.test(key));
-    // eslint-disable-next-line security/detect-object-injection
-    safeConfig[key] = isSensitive ? '[REDACTED]' : value;
-  }
+  for (const [key, value] of Object.entries(config)) {}
 
   return safeConfig;

[Survived] MethodExpression
backend-api/src/plugins/env.ts:58:25
   const safeConfig: Record<string, unknown> = {};
 
   for (const [key, value] of Object.entries(config)) {
-    const isSensitive = SENSITIVE_PATTERNS.some(pattern => pattern.test(key));
+    const isSensitive = SENSITIVE_PATTERNS.every(pattern => pattern.test(key));
     // eslint-disable-next-line security/detect-object-injection
     safeConfig[key] = isSensitive ? '[REDACTED]' : value;

[Survived] ArrowFunction
backend-api/src/plugins/env.ts:58:49
   const safeConfig: Record<string, unknown> = {};
 
   for (const [key, value] of Object.entries(config)) {
-    const isSensitive = SENSITIVE_PATTERNS.some(pattern => pattern.test(key));
+    const isSensitive = SENSITIVE_PATTERNS.some(() => undefined);
     // eslint-disable-next-line security/detect-object-injection
     safeConfig[key] = isSensitive ? '[REDACTED]' : value;

[NoCoverage] StringLiteral
backend-api/src/plugins/env.ts:60:37
   for (const [key, value] of Object.entries(config)) {
     const isSensitive = SENSITIVE_PATTERNS.some(pattern => pattern.test(key));
     // eslint-disable-next-line security/detect-object-injection
-    safeConfig[key] = isSensitive ? '[REDACTED]' : value;
+    safeConfig[key] = isSensitive ? "" : value;
   }
 

[Survived] BlockStatement
backend-api/src/plugins/env.ts:74:9
 
 export default fp(
   fastify => {
-    try {
-      const config = EnvSchema.parse(process.env);
-      fastify.decorate('config', config);
-
-      // Log safe config (sensitive fields redacted)
-      const safeConfig = createSafeConfig(config);
-      fastify.log.info(
-        { config: safeConfig },
-        'Environment configuration loaded'
-      );
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof z.ZodError) {
         const formattedErrors = error.errors.map(err => ({

[Survived] ObjectLiteral
backend-api/src/plugins/env.ts:81:9
       // Log safe config (sensitive fields redacted)
       const safeConfig = createSafeConfig(config);
       fastify.log.info(
-        { config: safeConfig },
+        {},
         'Environment configuration loaded'
       );

[NoCoverage] BlockStatement
backend-api/src/plugins/env.ts:84:21
         { config: safeConfig },
         'Environment configuration loaded'
       );
-    } catch (error) {
-      if (error instanceof z.ZodError) {
-        const formattedErrors = error.errors.map(err => ({
-          field: err.path.join('.'),
-          message: err.message,
-          code: err.code,
-          received: 'received' in err ? err.received : undefined,
-        }));
-
-        fastify.log.error(
-          {
-            validationErrors: formattedErrors,
-          },
-          'Environment validation failed'
-        );
-
-        throw new Error(
-          `Environment validation failed: ${formattedErrors.map(e => `${e.field}: ${e.message}`).join(', ')}`
-        );
-      }
-
-      fastify.log.error({ error }, 'Invalid environment configuration');
-      throw error;
-    }
+    } catch (error) {}
   },
   {

[NoCoverage] BlockStatement
backend-api/src/plugins/env.ts:85:40
         'Environment configuration loaded'
       );
     } catch (error) {
-      if (error instanceof z.ZodError) {
-        const formattedErrors = error.errors.map(err => ({
-          field: err.path.join('.'),
-          message: err.message,
-          code: err.code,
-          received: 'received' in err ? err.received : undefined,
-        }));
-
-        fastify.log.error(
-          {
-            validationErrors: formattedErrors,
-          },
-          'Environment validation failed'
-        );
-
-        throw new Error(
-          `Environment validation failed: ${formattedErrors.map(e => `${e.field}: ${e.message}`).join(', ')}`
-        );
-      }
+      if (error instanceof z.ZodError) {}
 
       fastify.log.error({ error }, 'Invalid environment configuration');

[NoCoverage] StringLiteral
backend-api/src/plugins/env.ts:87:32
     } catch (error) {
       if (error instanceof z.ZodError) {
         const formattedErrors = error.errors.map(err => ({
-          field: err.path.join('.'),
+          field: err.path.join(""),
           message: err.message,
           code: err.code,

[NoCoverage] ArrowFunction
backend-api/src/plugins/env.ts:101:65
         );
 
         throw new Error(
-          `Environment validation failed: ${formattedErrors.map(e => `${e.field}: ${e.message}`).join(', ')}`
+          `Environment validation failed: ${formattedErrors.map(() => undefined).join(', ')}`
         );
       }

[NoCoverage] StringLiteral
backend-api/src/plugins/env.ts:101:103
         );
 
         throw new Error(
-          `Environment validation failed: ${formattedErrors.map(e => `${e.field}: ${e.message}`).join(', ')}`
+          `Environment validation failed: ${formattedErrors.map(e => `${e.field}: ${e.message}`).join("")}`
         );
       }

[NoCoverage] StringLiteral
backend-api/src/plugins/env.ts:105:36
         );
       }
 
-      fastify.log.error({ error }, 'Invalid environment configuration');
+      fastify.log.error({ error }, "");
       throw error;
     }
