[NoCoverage] BlockStatement
apps/backend-api/src/server.ts:16:42
 
 server.register(app);
 
-const start = async (): Promise<void> => {
-  try {
-    await server.listen({ port: 3000, host: '0.0.0.0' });
-    server.log.info('Server listening on http://localhost:3000');
-  } catch (err) {
-    server.log.error(err);
-    throw new Error('Failed to start server');
-  }
-};
+const start = async (): Promise<void> => {};
 
 start().catch(error => {

[NoCoverage] BlockStatement
apps/backend-api/src/server.ts:17:7
 server.register(app);
 
 const start = async (): Promise<void> => {
-  try {
-    await server.listen({ port: 3000, host: '0.0.0.0' });
-    server.log.info('Server listening on http://localhost:3000');
-  } catch (err) {
+  try {} catch (err) {
     server.log.error(err);
     throw new Error('Failed to start server');

[NoCoverage] BlockStatement
apps/backend-api/src/server.ts:20:17
   try {
     await server.listen({ port: 3000, host: '0.0.0.0' });
     server.log.info('Server listening on http://localhost:3000');
-  } catch (err) {
-    server.log.error(err);
-    throw new Error('Failed to start server');
-  }
+  } catch (err) {}
 };
 

[NoCoverage] BlockStatement
apps/backend-api/src/server.ts:26:24
   }
 };
 
-start().catch(error => {
-  console.error('Failed to start server:', error);
-  process.exit(1);
-});
+start().catch(error => {});
 

[NoCoverage] StringLiteral
apps/backend-api/src/server.ts:27:17
 };
 
 start().catch(error => {
-  console.error('Failed to start server:', error);
+  console.error("", error);
   process.exit(1);
 });
